Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDam_bf.h
/**
 * \file IfxDam_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-01 09:51:34 GMT
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Dam_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Dam
 * 
 */
#ifndef IFXDAM_BF_H
#define IFXDAM_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dam_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_DAM_CLC_Bits.DISR */
#define IFX_DAM_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_DAM_CLC_Bits.DISR */
#define IFX_DAM_CLC_DISR_MSK (0x1)

/** \brief Offset for Ifx_DAM_CLC_Bits.DISR */
#define IFX_DAM_CLC_DISR_OFF (0)

/** \brief Length for Ifx_DAM_CLC_Bits.DISS */
#define IFX_DAM_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_DAM_CLC_Bits.DISS */
#define IFX_DAM_CLC_DISS_MSK (0x1)

/** \brief Offset for Ifx_DAM_CLC_Bits.DISS */
#define IFX_DAM_CLC_DISS_OFF (1)

/** \brief Length for Ifx_DAM_MODID_Bits.ID_VALUE */
#define IFX_DAM_MODID_ID_VALUE_LEN (32u)

/** \brief Mask for Ifx_DAM_MODID_Bits.ID_VALUE */
#define IFX_DAM_MODID_ID_VALUE_MSK (0xffffffff)

/** \brief Offset for Ifx_DAM_MODID_Bits.ID_VALUE */
#define IFX_DAM_MODID_ID_VALUE_OFF (0)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN0 */
#define IFX_DAM_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN0 */
#define IFX_DAM_ACCEN0_EN0_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN0 */
#define IFX_DAM_ACCEN0_EN0_OFF (0)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN1 */
#define IFX_DAM_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN1 */
#define IFX_DAM_ACCEN0_EN1_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN1 */
#define IFX_DAM_ACCEN0_EN1_OFF (1)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN2 */
#define IFX_DAM_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN2 */
#define IFX_DAM_ACCEN0_EN2_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN2 */
#define IFX_DAM_ACCEN0_EN2_OFF (2)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN3 */
#define IFX_DAM_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN3 */
#define IFX_DAM_ACCEN0_EN3_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN3 */
#define IFX_DAM_ACCEN0_EN3_OFF (3)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN4 */
#define IFX_DAM_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN4 */
#define IFX_DAM_ACCEN0_EN4_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN4 */
#define IFX_DAM_ACCEN0_EN4_OFF (4)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN5 */
#define IFX_DAM_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN5 */
#define IFX_DAM_ACCEN0_EN5_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN5 */
#define IFX_DAM_ACCEN0_EN5_OFF (5)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN6 */
#define IFX_DAM_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN6 */
#define IFX_DAM_ACCEN0_EN6_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN6 */
#define IFX_DAM_ACCEN0_EN6_OFF (6)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN7 */
#define IFX_DAM_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN7 */
#define IFX_DAM_ACCEN0_EN7_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN7 */
#define IFX_DAM_ACCEN0_EN7_OFF (7)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN8 */
#define IFX_DAM_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN8 */
#define IFX_DAM_ACCEN0_EN8_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN8 */
#define IFX_DAM_ACCEN0_EN8_OFF (8)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN9 */
#define IFX_DAM_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN9 */
#define IFX_DAM_ACCEN0_EN9_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN9 */
#define IFX_DAM_ACCEN0_EN9_OFF (9)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN10 */
#define IFX_DAM_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN10 */
#define IFX_DAM_ACCEN0_EN10_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN10 */
#define IFX_DAM_ACCEN0_EN10_OFF (10)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN11 */
#define IFX_DAM_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN11 */
#define IFX_DAM_ACCEN0_EN11_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN11 */
#define IFX_DAM_ACCEN0_EN11_OFF (11)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN12 */
#define IFX_DAM_ACCEN0_EN12_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN12 */
#define IFX_DAM_ACCEN0_EN12_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN12 */
#define IFX_DAM_ACCEN0_EN12_OFF (12)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN13 */
#define IFX_DAM_ACCEN0_EN13_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN13 */
#define IFX_DAM_ACCEN0_EN13_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN13 */
#define IFX_DAM_ACCEN0_EN13_OFF (13)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN14 */
#define IFX_DAM_ACCEN0_EN14_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN14 */
#define IFX_DAM_ACCEN0_EN14_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN14 */
#define IFX_DAM_ACCEN0_EN14_OFF (14)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN15 */
#define IFX_DAM_ACCEN0_EN15_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN15 */
#define IFX_DAM_ACCEN0_EN15_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN15 */
#define IFX_DAM_ACCEN0_EN15_OFF (15)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN16 */
#define IFX_DAM_ACCEN0_EN16_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN16 */
#define IFX_DAM_ACCEN0_EN16_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN16 */
#define IFX_DAM_ACCEN0_EN16_OFF (16)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN17 */
#define IFX_DAM_ACCEN0_EN17_LEN (1u)

