Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDam_bf.h
/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN17 */
#define IFX_DAM_ACCEN0_EN17_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN17 */
#define IFX_DAM_ACCEN0_EN17_OFF (17)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN18 */
#define IFX_DAM_ACCEN0_EN18_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN18 */
#define IFX_DAM_ACCEN0_EN18_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN18 */
#define IFX_DAM_ACCEN0_EN18_OFF (18)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN19 */
#define IFX_DAM_ACCEN0_EN19_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN19 */
#define IFX_DAM_ACCEN0_EN19_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN19 */
#define IFX_DAM_ACCEN0_EN19_OFF (19)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN20 */
#define IFX_DAM_ACCEN0_EN20_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN20 */
#define IFX_DAM_ACCEN0_EN20_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN20 */
#define IFX_DAM_ACCEN0_EN20_OFF (20)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN21 */
#define IFX_DAM_ACCEN0_EN21_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN21 */
#define IFX_DAM_ACCEN0_EN21_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN21 */
#define IFX_DAM_ACCEN0_EN21_OFF (21)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN22 */
#define IFX_DAM_ACCEN0_EN22_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN22 */
#define IFX_DAM_ACCEN0_EN22_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN22 */
#define IFX_DAM_ACCEN0_EN22_OFF (22)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN23 */
#define IFX_DAM_ACCEN0_EN23_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN23 */
#define IFX_DAM_ACCEN0_EN23_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN23 */
#define IFX_DAM_ACCEN0_EN23_OFF (23)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN24 */
#define IFX_DAM_ACCEN0_EN24_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN24 */
#define IFX_DAM_ACCEN0_EN24_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN24 */
#define IFX_DAM_ACCEN0_EN24_OFF (24)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN25 */
#define IFX_DAM_ACCEN0_EN25_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN25 */
#define IFX_DAM_ACCEN0_EN25_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN25 */
#define IFX_DAM_ACCEN0_EN25_OFF (25)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN26 */
#define IFX_DAM_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN26 */
#define IFX_DAM_ACCEN0_EN26_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN26 */
#define IFX_DAM_ACCEN0_EN26_OFF (26)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN27 */
#define IFX_DAM_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN27 */
#define IFX_DAM_ACCEN0_EN27_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN27 */
#define IFX_DAM_ACCEN0_EN27_OFF (27)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN28 */
#define IFX_DAM_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN28 */
#define IFX_DAM_ACCEN0_EN28_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN28 */
#define IFX_DAM_ACCEN0_EN28_OFF (28)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN29 */
#define IFX_DAM_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN29 */
#define IFX_DAM_ACCEN0_EN29_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN29 */
#define IFX_DAM_ACCEN0_EN29_OFF (29)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN30 */
#define IFX_DAM_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN30 */
#define IFX_DAM_ACCEN0_EN30_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN30 */
#define IFX_DAM_ACCEN0_EN30_OFF (30)

/** \brief Length for Ifx_DAM_ACCEN0_Bits.EN31 */
#define IFX_DAM_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN0_Bits.EN31 */
#define IFX_DAM_ACCEN0_EN31_MSK (0x1)

/** \brief Offset for Ifx_DAM_ACCEN0_Bits.EN31 */
#define IFX_DAM_ACCEN0_EN31_OFF (31)

/** \brief Length for Ifx_DAM_MEMCON_Bits.ROM */
#define IFX_DAM_MEMCON_ROM_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.ROM */
#define IFX_DAM_MEMCON_ROM_MSK (0x1)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.ROM */
#define IFX_DAM_MEMCON_ROM_OFF (0)

/** \brief Length for Ifx_DAM_MEMCON_Bits.INTERR */
#define IFX_DAM_MEMCON_INTERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.INTERR */
#define IFX_DAM_MEMCON_INTERR_MSK (0x1)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.INTERR */
#define IFX_DAM_MEMCON_INTERR_OFF (2)

/** \brief Length for Ifx_DAM_MEMCON_Bits.RMWERR */
#define IFX_DAM_MEMCON_RMWERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.RMWERR */
#define IFX_DAM_MEMCON_RMWERR_MSK (0x1)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.RMWERR */
#define IFX_DAM_MEMCON_RMWERR_OFF (4)

/** \brief Length for Ifx_DAM_MEMCON_Bits.DATAERR */
#define IFX_DAM_MEMCON_DATAERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.DATAERR */
#define IFX_DAM_MEMCON_DATAERR_MSK (0x1)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.DATAERR */
#define IFX_DAM_MEMCON_DATAERR_OFF (6)

/** \brief Length for Ifx_DAM_MEMCON_Bits.ADDERR */
#define IFX_DAM_MEMCON_ADDERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.ADDERR */
#define IFX_DAM_MEMCON_ADDERR_MSK (0x1)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.ADDERR */
#define IFX_DAM_MEMCON_ADDERR_OFF (7)

/** \brief Length for Ifx_DAM_MEMCON_Bits.PMIC */
#define IFX_DAM_MEMCON_PMIC_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.PMIC */
#define IFX_DAM_MEMCON_PMIC_MSK (0x1)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.PMIC */
#define IFX_DAM_MEMCON_PMIC_OFF (8)

/** \brief Length for Ifx_DAM_MEMCON_Bits.ERRDIS */
#define IFX_DAM_MEMCON_ERRDIS_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.ERRDIS */
#define IFX_DAM_MEMCON_ERRDIS_MSK (0x1)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.ERRDIS */
#define IFX_DAM_MEMCON_ERRDIS_OFF (9)

/** \brief Length for Ifx_DAM_SCTRL_Bits.GED */
#define IFX_DAM_SCTRL_GED_LEN (1u)

/** \brief Mask for Ifx_DAM_SCTRL_Bits.GED */
#define IFX_DAM_SCTRL_GED_MSK (0x1)

/** \brief Offset for Ifx_DAM_SCTRL_Bits.GED */
#define IFX_DAM_SCTRL_GED_OFF (0)

/** \brief Length for Ifx_DAM_SCTRL_Bits.GEC */
#define IFX_DAM_SCTRL_GEC_LEN (1u)

/** \brief Mask for Ifx_DAM_SCTRL_Bits.GEC */
#define IFX_DAM_SCTRL_GEC_MSK (0x1)

/** \brief Offset for Ifx_DAM_SCTRL_Bits.GEC */
#define IFX_DAM_SCTRL_GEC_OFF (1)

/** \brief Length for Ifx_DAM_RGN_LA_Bits.ADDR */
#define IFX_DAM_RGN_LA_ADDR_LEN (23u)

